КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыВладенияТранспортнымСредством/КонтурЛогистика_ВидыВладенияТранспортнымСредством.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыВладенияТранспортнымСредством</name>
  <enumValues>
    <name>Собственность_1</name>
  </enumValues>
  <enumValues>
    <name>СовместнаяСобственностьСупругов_2</name>
  </enumValues>
  <enumValues>
    <name>Аренда_3</name>
  </enumValues>
  <enumValues>
    <name>Лизинг_4</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПользование_5</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыВладенияТранспортнымСредством/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка= Собственность_1 Тогда 
		Результат = "1";
	ИначеЕсли Ссылка= СовместнаяСобственностьСупругов_2 Тогда 
		Результат = "2";
	ИначеЕсли Ссылка= Аренда_3 Тогда 
		Результат = "3";
	ИначеЕсли Ссылка= Лизинг_4 Тогда 
		Результат = "4";
	ИначеЕсли Ссылка= БезвозмездноеПользование_5 Тогда 
		Результат = "5";
	Иначе
		
		Результат = Неопределено;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Строка) Экспорт
	
	Если Строка = "1" Тогда 
		Результат = Собственность_1;
	ИначеЕсли Строка = "2"  Тогда 
		Результат = СовместнаяСобственностьСупругов_2;
	ИначеЕсли Строка = "3" Тогда 
		Результат = Аренда_3;
	ИначеЕсли Строка = "4" Тогда 
		Результат = Лизинг_4;
	ИначеЕсли Строка = "5" Тогда 
		Результат = БезвозмездноеПользование_5;
	Иначе
		
		Результат = ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДляВидаВладенияТребуетсяУказатьДоговор(Ссылка) Экспорт
	
	Результат = Ложь;
	
	Если 	Ссылка = Аренда_3 
		ИЛИ Ссылка = Лизинг_4 
		ИЛИ Ссылка = БезвозмездноеПользование_5 Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
